comparedDBs/performance_test_scripts/leveldb_scripts/10B_leveldb_YCSB_performance/leveldb_10B_val_128_mem1MB_zipf1.2_iterator4.log
../../../leveldb/release/db_bench --db=/mnt/hotdb_test/level10B/YCSBa_mem1_1.2_iterator4 --num=1000000000 --value_size=128 --batch_size=1000 --benchmarks=fillzipf,stats --data_file=/home/jeff-wang/workloads/zipf1.2_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --cache_size=8388608 --mem_log_file=/home/jeff-wang/WorkloadAnalysis/comparedDBs/performance_test_scripts/leveldb_scripts/10B_leveldb_zipf_hot_removal/leveldb_memory_usage1MB_10B_key16_val128.log --open_files=40000 --compression=0 --stats_interval=100000000 --histogram=1 --write_buffer_size=1048576 --max_file_size=1048576 --print_wa=true 
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000000
RawSize:    137329.1 MB (estimated)
FileSize:   76293.9 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
some command parameters have been selected:
  threads: 1
  duration: 0
  print_wa: 1
  num_entries: 1000000000
  bechmark selected fillzipf,stats
  hot_file_path: 
  data_file_path: /home/jeff-wang/workloads/zipf1.2_keys10.0B.csv
  percentages: 
------------------------------------------------
start benchmarking num_ = 1000000000 entries in DoWrite_zipf2()
2024-11-21 01:46:11 ... thread 0: (99999999,99999999) ops and (17098.1,17098.1) ops/second in (5848.620095,5848.620095) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     1       1     877        0        0     13801     13801      0    2064 17345     0       0     0      0  2064         0 0.000000 0.000000
    1    29      20    3034    51992    51992     40180     40180      0    2180  2316     0       0     0  57514  2180        20 0.000000 1.020329
    2   226     199     922    17466    17466     16571     16571      0     561   591     0       0     0  17350   561       293 1.020329 0.000306
    3   721     720      88     1846     1846      1692      1692      0       0     0     0       0     0   1455     0         0 0.000306 0.000000
user_io:13800.556MB total_ios: 72243.986MB WriteAmplification: 5.2349
leveldb statistical: 99999999 operations (real operations: 100000000) have been finished (user has been written 0.000 MB data into db.)


2024-11-21 03:52:21 ... thread 0: (100000000,199999999) ops and (13209.8,14904.5) ops/second in (7570.113750,13418.733845) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     1       1    1919        0        0     27603     27603      0    4105 34694     0       0     0      0  4105         0 0.000000 0.000000
    1    35      20    6965   105950   105950     82248     82248      0    4349  4611     0       0     0 119086  4349        38 0.000000 1.020544
    2   260     200    2100    35069    35069     33297     33297      0    1625  1728     0       0     0  37597  1625       293 1.020544 0.000306
    3  1422    1400     311     6538     6538      6030      6030      0       0     0     0       0     0   5415     0         0 0.000306 0.000000
user_io:27603.491MB total_ios: 149178.140MB WriteAmplification: 5.4043
leveldb statistical: 199999999 operations (real operations: 200000000) have been finished (user has been written 13733.014 MB data into db.)


2024-11-21 06:01:47 ... thread 0: (100000000,299999999) ops and (12877.7,14161.5) ops/second in (7765.388741,21184.122586) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     4       3    2943        0        0     41406     41406      0    6154 52040     0       0     0      0  6154         0 0.000000 0.000000
    1    27      20   10830   159918   159918    124328    124328      0    6542  6934     0       0     0 180854  6542        58 0.000000 1.021344
    2   275     189    3353    52842    52842     50182     50182      0    2707  2882     0       0     0  61089  2707       356 1.021344 1.023223
    3  1910    1872     608    12985    12985     12169     12169      0       0     0     0       0     0  11214     0       258 1.023223 1.022854
    4   258     255       0        0        0         0         0      0       0     0     0       0     0      0     0         0 1.022854 0.000000
user_io:41406.422MB total_ios: 228084.624MB WriteAmplification: 5.5084
leveldb statistical: 299999999 operations (real operations: 300000000) have been finished (user has been written 27466.030 MB data into db.)


2024-11-21 08:31:23 ... thread 0: (100000000,399999999) ops and (11140.9,13262.6) ops/second in (8975.924141,30160.046727) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     5       4    4097        0        0     55209     55209      0    8196 69388     0       0     0      0  8196         0 0.000000 0.000000
    1    33      21   15173   213730   213730    166251    166251      0    8704  9217     0       0     0 242036  8704        74 0.000000 1.021972
    2   304     202    4783    70306    70306     66761     66761      0    3782  4131     0       0     0  84764  3782       464 1.021972 1.022245
    3  2054    2001    1087    19832    19832     18808     18808      0       3     3     0       0     0  17552     3       943 1.022245 0.991697
    4   945     932       1       14       14        14        14      0       0     0     0       0     0     12     0         0 0.991697 0.000000
user_io:55209.334MB total_ios: 307043.175MB WriteAmplification: 5.5614
leveldb statistical: 399999999 operations (real operations: 400000000) have been finished (user has been written 41199.045 MB data into db.)


2024-11-21 10:31:15 ... thread 0: (100000000,499999999) ops and (13904.0,13386.1) ops/second in (7192.188692,37352.235419) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     0       0    4988        0        0     69013     69013      0   10270 86743     0       0     0      0 10270         0 0.000000 0.000000
    1    32      20   18619   267832   267832    208471    208471      0   10882 11517     0       0     0 303811 10882        93 0.000000 1.020844
    2   266     200    5903    87997    87997     83567     83567      0    4864  5272     0       0     0 108860  4864       469 1.020844 0.541312
    3  2032    1965    1468    26217    26217     24820     24820      0       5     5     0       0     0  23381     5      1656 0.541312 1.022499
    4  1660    1639       1       22       22        21        21      0       0     0     0       0     0     17     0         0 1.022499 0.000000
user_io:69013.075MB total_ios: 385892.304MB WriteAmplification: 5.5916
leveldb statistical: 499999999 operations (real operations: 500000000) have been finished (user has been written 54932.060 MB data into db.)


2024-11-21 12:18:35 ... thread 0: (100000000,599999999) ops and (15527.0,13700.9) ops/second in (6440.377972,43792.613391) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     5       4    5781        0        0     82815     82815      0   12363 104086     0       0     0      0 12363         0 0.000000 0.000000
    1    30      20   21737   322093   322093    250863    250863      0   13061 13818     0       0     0 365892 13061       118 0.000000 1.021130
    2   297     198    6893   105770   105770    100450    100450      0    6012  6493     0       0     0 133930  6012       469 1.021130 0.541312
    3  2060    1958    1712    33395    33395     31572     31572      0       7     7     0       0     0  30062     7      2290 0.541312 0.285398
    4  2296    2261       1       35       35        34        34      0       0     0     0       0     0     28     0         0 0.285398 0.000000
user_io:82815.176MB total_ios: 465734.183MB WriteAmplification: 5.6238
leveldb statistical: 599999999 operations (real operations: 600000000) have been finished (user has been written 68665.074 MB data into db.)


2024-11-21 14:07:39 ... thread 0: (100000000,699999999) ops and (15282.7,13906.6) ops/second in (6543.334502,50335.947893) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     0       0    6563        0        0     96618     96618      0   14453 121440     0       0     0      0 14453         0 0.000000 0.000000
    1    29      20   24872   376180   376180    293059    293059      0   15227 16096     0       0     0 427649 15227       140 0.000000 1.021571
    2   308     200    7881   123328   123328    117138    117138      0    7235  7755     0       0     0 157786  7235       469 1.021571 0.541312
    3  1956    1857    1998    40631    40631     38346     38346      0       9     9     0       0     0  36909     9      2987 0.541312 1.020010
    4  2995    2945       2       52       52        52        52      0       0     0     0       0     0     43     0         0 1.020010 0.000000
user_io:96618.089MB total_ios: 545212.747MB WriteAmplification: 5.6430
leveldb statistical: 699999999 operations (real operations: 700000000) have been finished (user has been written 82398.090 MB data into db.)


2024-11-21 15:57:57 ... thread 0: (100000000,799999999) ops and (15109.2,14046.3) ops/second in (6618.493900,56954.441793) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     3       2    7347        0        0    110422    110422      0   16534 138786     0       0     0      0 16534         0 0.000000 0.000000
    1    36      21   27964   430195   430195    335190    335190      0   17396 18383     0       0     0 489275 17396       160 0.000000 0.000306
    2   251     200    8846   140982   140982    133914    133914      0    8283  8920     0       0     0 181782  8283       600 0.000306 0.298923
    3  2067    1943    2345    46987    46987     44391     44391      0     467   467     0       0     0  43028   467      3185 0.298923 0.000306
    4  3270    3229      52     1318     1318       961       961      0       0     0     0       0     0   1088     0         0 0.000306 0.000000
user_io:110421.818MB total_ios: 624877.990MB WriteAmplification: 5.6590
leveldb statistical: 799999999 operations (real operations: 800000000) have been finished (user has been written 96131.105 MB data into db.)


2024-11-21 17:43:14 ... thread 0: (100000000,899999999) ops and (15830.6,14224.5) ops/second in (6316.875515,63271.317308) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     7       6    8084        0        0    124225    124225      0   18628 156131     0       0     0      0 18628         0 0.000000 0.000000
    1    34      20   30920   484693   484693    377802    377802      0   19585 20685     0       0     0 551714 19585       184 0.000000 0.000308
    2   284     199    9760   158704   158704    150754    150754      0    9404 10143     0       0     0 207009  9404       601 0.000308 0.204931
    3  2086    1940    2625    54190    54190     51262     51262      0    1188  1190     0       0     0  49921  1188      3185 0.204931 0.000306
    4  3757    3747     140     3261     3261      2717      2717      0       0     0     0       0     0   2685     0         0 0.000306 0.000000
user_io:124224.740MB total_ios: 706760.083MB WriteAmplification: 5.6894
leveldb statistical: 899999999 operations (real operations: 900000000) have been finished (user has been written 109864.120 MB data into db.)


2024-11-21 19:29:54 ... thread 0: (100000000,999999999) ops and (15625.2,14353.1) ops/second in (6399.903575,69671.220883) seconds
                               Compactions
Level Files Size(M) Time(s) ReadH(M) ReadC(M) WriteH(M) WriteC(M) m_comp si_comp ifile pfile se_comp ifiles pfiles comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     2       2    8820        0        0    138028    138028      0   20723 173486     0       0     0      0 20723         0 0.000000 0.000000
    1    35      20   33888   539213   539213    420430    420430      0   21763 22995     0       0     0 614253 21763       206 0.000000 1.020210
    2   310     199   10702   176387   176387    167550    167550      0   10546 11354     0       0     0 231636 10546       602 1.020210 0.148381
    3  2143    1953    2893    61417    61417     58153     58153      0    1883  1887     0       0     0  56954  1883      3185 0.148381 0.000306
    4  4372    4392     233     5157     5157      4579      4579      0       0     0     0       0     0   4248     0         0 0.000306 0.000000
user_io:138027.665MB total_ios: 788739.526MB WriteAmplification: 5.7144
leveldb statistical: 999999999 operations (real operations: 1000000000) have been finished (user has been written 123597.135 MB data into db.)


1000000000 operations have been finished (137330.149 MB data have been written into db)
fillzipf     :      69.671 micros/op 14353 ops/sec;    2.0 MB/s
Microseconds per op:
Count: 1000000000  Average: 69.6712  StdDev: 1996.21
Percentiles: P50: 7.29 P75: 10.56 P99: 1167.47 P99.9: 3923.58 P99.99: 47861.29
------------------------------------------------------
[       2,       3 )       5   0.000%   0.000% 
[       3,       4 ) 5293190   0.529%   0.529% 
[       4,       5 ) 106082210  10.608%  11.138% ##
[       5,       6 ) 203840582  20.384%  31.522% ####
[       6,       7 ) 153158845  15.316%  46.837% ###
[       7,       8 ) 110170313  11.017%  57.855% ##
[       8,       9 ) 84105341   8.411%  66.265% ##
[       9,      10 ) 63579548   6.358%  72.623% #
[      10,      12 ) 85378548   8.538%  81.161% ##
[      12,      14 ) 54384278   5.438%  86.599% #
[      14,      16 ) 41252432   4.125%  90.725% #
[      16,      18 ) 28192340   2.819%  93.544% #
[      18,      20 ) 15183259   1.518%  95.062% 
[      20,      25 ) 10933943   1.093%  96.155% 
[      25,      30 ) 2865249   0.287%  96.442% 
[      30,      35 ) 1020676   0.102%  96.544% 
[      35,      40 )  390794   0.039%  96.583% 
[      40,      45 )  146854   0.015%  96.598% 
[      45,      50 )   70806   0.007%  96.605% 
[      50,      60 )   68960   0.007%  96.612% 
[      60,      70 )   41734   0.004%  96.616% 
[      70,      80 )   33345   0.003%  96.619% 
[      80,      90 )   29559   0.003%  96.622% 
[      90,     100 )   25667   0.003%  96.625% 
[     100,     120 )   40093   0.004%  96.629% 
[     120,     140 )   29378   0.003%  96.632% 
[     140,     160 )   26235   0.003%  96.634% 
[     160,     180 )   22879   0.002%  96.637% 
[     180,     200 )   20791   0.002%  96.639% 
[     200,     250 )   50847   0.005%  96.644% 
[     250,     300 )   49604   0.005%  96.649% 
[     300,     350 )   48613   0.005%  96.654% 
[     350,     400 )   48399   0.005%  96.659% 
[     400,     450 )   48560   0.005%  96.663% 
[     450,     500 )   43975   0.004%  96.668% 
[     500,     600 )   76206   0.008%  96.675% 
[     600,     700 )   54012   0.005%  96.681% 
[     700,     800 )   47573   0.005%  96.686% 
[     800,     900 )   48665   0.005%  96.690% 
[     900,    1000 )   41894   0.004%  96.695% 
[    1000,    1200 ) 27532546   2.753%  99.448% #
[    1200,    1400 ) 2179978   0.218%  99.666% 
[    1400,    1600 )  437615   0.044%  99.710% 
[    1600,    1800 )  314602   0.031%  99.741% 
[    1800,    2000 )  286618   0.029%  99.770% 
[    2000,    2500 )  480080   0.048%  99.818% 
[    2500,    3000 )  397617   0.040%  99.858% 
[    3000,    3500 )  265763   0.027%  99.884% 
[    3500,    4000 )  187660   0.019%  99.903% 
[    4000,    4500 )  133750   0.013%  99.916% 
[    4500,    5000 )   94016   0.009%  99.926% 
[    5000,    6000 )  126692   0.013%  99.938% 
[    6000,    7000 )   80730   0.008%  99.946% 
[    7000,    8000 )   50949   0.005%  99.951% 
[    8000,    9000 )   34444   0.003%  99.955% 
[    9000,   10000 )   26178   0.003%  99.958% 
[   10000,   12000 )   42744   0.004%  99.962% 
[   12000,   14000 )   43524   0.004%  99.966% 
[   14000,   16000 )   37320   0.004%  99.970% 
[   16000,   18000 )   42374   0.004%  99.974% 
[   18000,   20000 )   39651   0.004%  99.978% 
[   20000,   25000 )   62588   0.006%  99.984% 
[   25000,   30000 )   25268   0.003%  99.987% 
[   30000,   35000 )   11494   0.001%  99.988% 
[   35000,   40000 )   10560   0.001%  99.989% 
[   40000,   45000 )    6966   0.001%  99.990% 
[   45000,   50000 )    3619   0.000%  99.990% 
[   50000,   60000 )    4375   0.000%  99.991% 
[   60000,   70000 )    4580   0.000%  99.991% 
[   70000,   80000 )   55482   0.006%  99.997% 
[   80000,   90000 )    3195   0.000%  99.997% 
[   90000,  100000 )    2030   0.000%  99.997% 
[  100000,  120000 )    2362   0.000%  99.997% 
[  120000,  140000 )    2138   0.000%  99.998% 
[  140000,  160000 )    1898   0.000%  99.998% 
[  160000,  180000 )    1232   0.000%  99.998% 
[  180000,  200000 )    1093   0.000%  99.998% 
[  200000,  250000 )    3542   0.000%  99.998% 
[  250000,  300000 )    4032   0.000%  99.999% 
[  300000,  350000 )    3893   0.000%  99.999% 
[  350000,  400000 )    2953   0.000%  99.999% 
[  400000,  450000 )    1939   0.000% 100.000% 
[  450000,  500000 )    1094   0.000% 100.000% 
[  500000,  600000 )    1327   0.000% 100.000% 
[  600000,  700000 )     561   0.000% 100.000% 
[  700000,  800000 )     273   0.000% 100.000% 
[  800000,  900000 )     147   0.000% 100.000% 
[  900000, 1000000 )     103   0.000% 100.000% 
[ 1000000, 1200000 )     120   0.000% 100.000% 
[ 1200000, 1400000 )      40   0.000% 100.000% 
[ 1400000, 1600000 )      14   0.000% 100.000% 
[ 1600000, 1800000 )      11   0.000% 100.000% 
[ 1800000, 2000000 )       6   0.000% 100.000% 
[ 2000000, 2500000 )      10   0.000% 100.000% 
[ 2500000, 3000000 )       1   0.000% 100.000% 
[ 3000000, 3500000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        2      8820        0    138028
  1       35       20     33888   539213    420430
  2      310      199     10702   176387    167550
  3     2143     1953      2893    61417     58153
  4     4372     4392       233     5157      4579
user_io:138027.665MB total_ios: 788739.526MB WriteAmplification: 5.7144